{
  "landingTitle": "About Me",
  "landingInformation": "Welcome to my portfolio. I am Richard, a student at the Slovak University of Technology, Faculty of Computer Science and Information Technology (FIIT). I have been involved in the field of information technology for five years. Before joining the university, I dedicated my efforts to semi-professional sports. In my spare time, I carry out personal projects and active involvement in school projects.",
  "workExperienceTitle": "Work Experience",
  "workInformation": [
    {
      "title": "Work experience",
      "description": "During my studies at university I was able to gain experience during my internship at Slovanet. Within this opportunity I had the chance to get closer to the practical aspects of information technology. My main task was the development of special modules for the internal ERP system Odoo."
    },
    {
      "title": "Personal Projects",
      "description": "Thanks to my studies at university, I have acquired a significant amount of valuable information that has helped me to understand the basic principles in my field. I am currently focusing on several projects and I am constantly striving to expand my personal knowledge and skills."
    }
  ],
  "interestReasonTitle": "Why me",
  "interestInformation": [
    {
      "title": "The main reason",
      "description": "My main objective is to continuously improve myself in field of technology. In addition to working on specific tasks, I try to actively observe and absorb best practices from experienced engineers."
    },
    {
      "title": "Work environment",
      "description": "I was active in team sports from an early age, which helped me develop the ability to work effectively as a team. I am able to adapt quickly to new work environments and actively interact with my colleagues."
    },
    {
      "title": "Work under stress",
      "description": "I always strive to complete tasks on time and with the highest level of care in order to meet deadlines and achieve high quality results. Although working under stress is not enjoyable, I am able to handle it."
    }
  ],
  "projects": [
    {
      "title": "University",
      "context": "During my time at college, I have gained important knowledge that has helped me to better understand the underlying contexts in my field. I acquired skills in the C programming language, which I still use today. In addition, I was first introduced to the JavaScript programming language, which we worked on for a semester project."
    },
    {
      "title": "Python",
      "context":"I've been around object-oriented programming with Python for a longer period of time. In high school, I passed the final exam in this language. In addition, I have participated in the creation of several custom websites that were implemented using the Flask or Django frameworks. Later on, I took part in a work placement at Slovanet, where I participated in the development of an internal ERP system."
    },
    {
      "title": "JavaScript",
      "context":"During our second semester in college, we worked on developing a web game using JavaScript. This project is driven by the model-view-controller (MVC) architecture and meets various criteria essential for object-oriented programming (OOP). In addition, I further expanded my knowledge by working on this portfolio, which is built on the React library. I also have a project in progress that uses the MERN technology stack."
    },
    {
      "title": "C Sharp",
      "context": "My first project I worked on was a mobile game called Mark Ball. This game is available for download on the Google Play platform. The project was implemented using the C# programming language, however, I am currently no longer familiar with this language."
    }
  ],
  "projects_outro_title":"My Projects Summary",
  "projects_outro_context":"I have used several technologies in these projects. As far as design technologies are concerned, I have used descriptive language Html, CSS or I have also encountered XML. I used frameworks like Tailwind or Bootstrap and in one project I did implement Wysivig editor. As for libraries I used Flask, Django, React, ExpressJs, Tkinter and others. The languages I've encountered are C, Python, Javascript, Bash.",
  "contact_titel": "Contact",
  "contact_description": "If you are interested in more information or need help with project, please do not hesitate to contact me by e-mail.",
  "navigation": [
    {
      "title": "Home"
    },
    {
      "title": "About me"
    },
    {
      "title": "My work"
    },
    {
      "title": "Why me"
    },
    {
      "title": "Contact"
    }
  ],
  "footer": [
    {
      "title": "Home",
      "redirect": "/"
    },
    {
      "title": "My projects",
      "redirect": "/projects"
    },
    {
      "title": "Certificates",
      "redirect": "/certificate"
    }
  ],
  "project_intro": [
    {
      "title": "My projects",
      "context": "More information about my projects are available on my GitHub profile. There are detailed descriptions of each project and installation guides."
    }
  ]
}