{
  "welcome": "Vitajte na mojom portfóliu!",
  "about": "O mne",
  "cardsOne": [
    {
      "title": "Kúsok o mne",
      "description": "Ahojte, volám sa Richard. Som 21-ročný študent Slovenskej technickej univerzity. Rád sa učim novým schopnostiam a naberám nové znalosti. Som schopný prispôsobiť sa pracovním prostrediam z rôznych oborov. Brigádoval som na stavbe, ako čašník alebo pracoval som ako programátor v Slovanete."
    },
    {
      "title": "Od športu k informatike",
      "description": "Môj záujem o informatiku sa začal, keď som mal 17 rokov. Narazil som na 3D modelovací softvér Blender, počas sledovania videii o hrách. Kód v Blenderi som nepísal, ale začal ma zaujímať proces tvorby hier. Začal som sa učiť programovací jazyk C# a objavil som softvér Unity. To ma priviedlo k vytvoreniu hry s názvom „Mark Ball“, ktorá je dostupná na stiahnutie v obchode Google Play."
    },
    {
      "title": "Prečo som si vybral štúdium informatiky",
      "description": "Vybral som si štúdium informatiky a technológií, pretože mám k tomuto oboru vášeň. Zaujíma ma proces tvorby softvéru, webov a ďalších počítačových prostriedkov. Čo ma na tomto obore baví je, že sa stačí naučiť logické vzory a postupy, ktoré následne môžem používať na tvorbu komplexných projektov."
    }
  ],
  "cardsTwo": [
    {
      "title": "Vzdelanie",
      "description": "Ako malý som navštevoval základnú školu Tilgnerovú. Neskôr som prestúpil na Zš Svätej Uršule. Po základnej škole som sa rozhodol svoje vzdelanie smerovať na šport. Na Strednej Športovej škole v Ružinove som zmaturoval z povinných predmetov, angličtiny, trénerstva, matematiky. Maturoval som aj z informatiky ako dodatočný dobrovoľný predmet. Následne som nastúpil na STU FIIT, na ktorú som chcel nastúpiť už od tretieho ročníka strednej školy."
    },
    {
      "title": "Rané skúsenosti",
      "description": "Na strednej škole som sa začal zaujímať trocha viac o informatiku. V tom čase som študoval programovací jazyk Python a pracoval na niekoľkých projektoch. Používal som Flask a učil sa základným webovým technológiám ako HTML a CSS a experimentoval s rôznymi frameworkami."
    },
    {
      "title": "Moje najnovšie skúsenosti",
      "description": "Počas prvého roku na univerzite som získal veľa nových poznatkov z praxe a aj teoretických informácií. Učili sme sa napríklad, ako sa tvoria väčšie projekty, hlbšie sme sa venovali OOP a abstraktnejším častiam väčších projektov. To, čo som sa naučil na škole, som mohol vidieť v spoločnosti, kde som pracoval. Prax som si získal v oblasti pythonu, kde som sa prvýkrát stretol s xml. Počas školy sme pracovali na viacerých projektoch, kde sme používali C, JavaScript, Shell Scripting a spolupracoval som s jedným prednášajúcim na doplnkovom projekte zameranom na SEO."
    }
  ],
  "projects" : [
    {
      "title" : "Python",
      "description" : "Programovací jazyk python som si obľúbil najviac zo všetkých pretože je jednoduchý a multifunkčný. Tomuto jazyku som sa začal venovať na strednej škole kde som robil jednoduché zadania na hodinách informatiky alebo doma. Následne som si vyskúšal tvorbu stránky za pomoci tohoto jazyka kde som sa naučil aj deskriptívne jazyky. Python som používal aj pri maturite z informatiky. Po strednej Škole som používal python v Slovanete kde som pracoval v internom systéme Odoo.",
      "links" : [
        {"link - 1 " : "https://google.com"},
        {"link - 1 " : "https://google.com"},
        {"link - 1 " : "https://google.com"},
        {"link - 1 " : "https://google.com"}
      ]
    },
    {
      "title" : "C - Sharp",
      "description" : "Jazyk C# momentálne neovládam a ani sa mu aktívne nevenujem. Tento jazyk som sa naučil ešte predtým než som sa stretol s pythonom. Svoje skúsenosti z blenderu som chcel nejako využíť. Rozhodol som sa vytvoriť hru pre mobilné zariadenia. Tu som sa stretol s programom Unity a programovacím jazykom C#. Hru som následne pridal na google store kde je stále dostupná na stiahnutie. Hra sa volá Mark ball a je to jednoduchá indie hra kde hráč musí prejsť niekoľko levelov bez kolízie do iných objektov. Skúsenosť v tomto jazyku by som mohol uviesť ako môj vstup do sveta informatiky."
    },
    {
      "title" : "C",
      "description" : "Tento jazyk sme sa učili počas prvých dvoch semestrov na Vysokej škole. Vypracovali sme v ňom veľa projektov a zadaní z cvičení. Vďaka tomuto jazyku lepšie chápem na čom sú postavané iné programovacie jazyky, ako fungujú alebo napríklad proces spracovania programu. Tento jazyk mi teda dal hlbšie nahliadnutie do sveta programovania."
    },
    {
      "title" : "Webové technológie",
      "description" : "K webovým technológiam ako mojim znalostiam by som zaradil to že ovládam deskriptívne jazyky ako html,css alebo že som sa ponoril trochu do sveta SEO. Taktiež som sa stertol v systéme Odoo s jazykom XML. Zaradil by som sem aj prácu na viacerých wordpresových webstránkach, kde som menil pár vecí na mieru. SEO optimalizáciu som vykonával hlavne na wordpresových stránkach, ale ako som už spomínal spolupracoval som aj s Doktorom z fakulty na jednom projekte zameranom na SEO."
    },
    {
      "title" : "Javascript",
      "description" : "Počas druhého semestra sme mali predmet kde sme sa venovali OOP. Učili sme sa teóriu, ktorú sme neskôr využili v praxi na cvvičeniach. Pracovali sme na projekte webovej hry spracovanej čisto v Javascripte. Projekt musel mať určitú štruktúru a musel splňovať isté podmienky. Tento jazyk sa mi veľmi zapáčil, keďže sa veľmi podobá Pythonu. Rád by som sa Javascriptu venovaľ naďalej preto som sa rozhodol toto portfólio založiť pomocou Reactu."
    },
    {
      "title" : "Pracovné skúsenosti",
      "description" : "Tesne po začiatku Vysokej školy som nastúpil do Slovanetu ako stážista. Pracovali sme na internom systéme Odoo, kde som získal svoju prvú prax vo firme. Naučil som ako fungujú tímy zamerané na informatiku v spoločnosti, stretol som sa s organizovaním úloh a vypracovavaním týchto úloh do určitých deadlinov. Mal som možnosť sledovať a učiť sa od skúsených vedúcich leaderov našich tímov alebo preberať určitú zodpovednosť za pracú ktorá mi bola pridelená. Táto pracovná pozícia mi dala mnoho skúsenosti za čo som vďačný."
    }
  ],
  "future_introduction_title" : "Moje plány do budúcnosti",
  "future_introduction" : "Môžete si prečítať o projektoch na ktorých momentálne pracujem alebo čo plánujem podniknúť vo svojej budúcnosti. Článok prepnete kliknutím na odkaz alebo napísaním vhodného commandu. Príkazový riadok aktivujete kliknutím na kurzor.",
  "future_command_help" : "Displays system chosen article of projects that are being worked on or that are planned to be done in the future",
  "future_error_msg" : "Your input is spelled wrongly! Only possible option is article -[type]",
  "future" : [
    {
      "command" : "mern -r",
      "title" : "Mern aplikácia ",
      "command_des" : "Načítate si text opisujúci aplikáciu založenú na MERN tech stacku.",
      "description" : "Tento projekt by mal byť dokončený v priebehu jedného až dvoch rokov. Vo finálnom výsledku by to mala byť aplikácia pre gastro podniky ktorá zjednoduchší organizáciu tímu v gastre. Taktiež bude použiteľná pre ľudí, ktorý si budú schopný objednať jedlo alebo rezervovať stôl. Aplikácia je založená hlavne na MERN tech stacku čo znamená Mongo databáza, Express js pre backend, React pre frontend a celá aplikácia beží za pomoci node js. Využívam pri tvorbe rôzne externé softwary ale spomínané technológie sú základ."
    },
    {
      "command" : "blog -i",
      "title" : "Blog",
      "command_des" : "Zobrazí sa článok o naplánovanom projekte blogu.",
      "description" : "Hlavný zámer blogu je rozšírť si znalosť v jazykoch, získať skúsenosť vo vedení tímu a opakovanie si tém preberaných v škole. V blogu by som chcel využiť materiály poskytované Fakultou a preskúmať preberané témy hlbšie o ktorých by som následne písal články. Články budú napísané aj v cudzích jazykoch čím by som si vylepšil slovník a upevnil základy cudzích jazykov."
    },
    {
      "command" : "education -n",
      "title" : "Vzdelávanie do budúcna",
      "command_des" : "Článok vysvetlí na čo sa chcem do budúcna zamerať",
      "description" : "Do budúcna sa plánujem naučiť plinulo rozprávať minimálne ďaľším jedným cudzím jazykom. Svoje vzdelanie by som chcel smerovať hlavne na inovatívnu časť informatiky ako AI, ML a podobné. Mojim cieľom je pomôcť ľudom zjednoduchšiť ich prácu."
    }
  ], 
  "contact_titel" : "Kontaktujete ma!",
  "contact_description" : "Ak Vás moje portfólio zaujalo neváhajte ma kontaktovať prostredníctvom mailu alebo formuláru. Rád Vám odpoviem na Vaše otázky alebo pomôžem s vašim projektom.",
  "navigation" : [
    {
      "title" : "Domov"
    },
    {
      "title" : "O mne"
    },
    {
      "title" : "Moje projekty"
    },
    {
      "title" : "Budúcnosť"
    },
    {
      "title" : "Kontakt"
    }
  ]
}
