{
  "landingTitle": "O mne",
  "landingInformation": "Vítam vás na mojom portfóliu. Som Richard, študent Slovenskej technickej univerzity na Fakulte informatiky a informačných technológií (FIIT). Oboru informačných technológií sa venujem po dobu piatich rokov. Pred nástupom na univerzitu som dedikoval svoje úsilie semi-profesionálnemu športu. Vo voľnom čase sa venujem osobným projektom a aktívnemu zapájaniu do školských projektov.",
  "workExperienceTitle": "Pracovné skúsenosti",
  "workInformation": [
    {
      "title": "Pracovné skúsenosti",
      "description": "V priebehu mojich štúdií na vysokej škole som mohol získať skúsenosti, počas stáže v spoločnosti Slovanet. V rámci tejto príležitosti som mal možnosť priblížiť sa k praktickým aspektom informačných technológií. Mojou hlavnou úlohou bolo vývoj špeciálnych modulov pre interný ERP systém Odoo."
    },
    {
      "title": "Osobné projekty",
      "description": "Vďaka mojim štúdiám na univerzite som nadobudol významné množstvo cenných informácií, ktoré mi pomohli porozumieť základným princípom v mojom odbore. Momentálne sa zameriavam na viaceré projekty a neustále sa snažím rozširovať moje osobné vedomosti a schopnosti."
    }
  ],
  "interestReasonTitle": "Prečo práve ja",
  "interestInformation": [
    {
      "title": "Hlavný dôvod",
      "description": "Mojím hlavným cieľom je neustále sa zdokonaľovať vo svojom odbore. Okrem práce na konkrétnych úlohách sa snažím aktívne sledovať a absorbovať osvedčené postupy od skúsených inžinierov."
    },
    {
      "title": "Pracovné prostredie",
      "description": "Od útleho veku som sa aktívne venoval tímovej športovej disciplíne, čo mi pomohlo vyvinúť schopnosť efektívnej tímovej spolupráce. Som schopný rýchlo sa adaptovať na nové pracovné prostredie a aktívne komunikovať so svojimi kolegami."
    },
    {
      "title": "Práca pod stresom",
      "description": "Vždy sa snažím dokončiť úlohy včas a s maximálnou starostlivosťou, aby som splnil stanovené termíny a dosiahol vysokú kvalitu výsledkov. Aj keď práca pod stresom nie je príjemná, som schopný ju zvládnuť."
    }
  ],
  "projects": [
    {
      "title": "Vysoká škola",
      "context": "Počas môjho štúdia na vysokej škole som získal dôležité poznatky, ktoré mi pomohli lepšie porozumieť základným kontextom v mojom odbore. Nadobudol som zručnosti v programovacom jazyku C, ktorý stále využívam v súčastnosti. Okrem toho som sa prvýkrát zoznámil s programovacím jazykom JavaScript, na ktorom sme pracovali pri semestrálnom projekte."
    },
    {
      "title": "Python",
      "context":"V oblasti objektovo orientovaného programovania s jazykom Python, som sa pohyboval už dlhšiu dobu. Na strednej škole som úspešne absolvoval maturitnú skúšku z tohto jazyka. Okrem toho som participoval na vytváraní viacerých vlastných webových stránok, ktoré boli implementované pomocou frameworkov Flask, alebo Django. Neskôr som sa zapojil do pracovnej stáže v spoločnosti Slovanet, kde som sa podieľal na vývoji interného ERP systému."
    },
    {
      "title": "Javascript",
      "context":"V priebehu druhého semestra na vysokej škole sme sa venovali vývoju webovej hry pomocou JavaScriptu. Tento projekt je riadený podľa model-view-controller (MVC) architektúry a spĺňa rôzne kritériá podstatné pre objektovo orientované programovanie (OOP). Okrem toho som ďalej rozširoval svoje znalosti prácou na tomto portfóliu, ktoré je postavené na React frameworku. Mám tiež rozpracovaný projekt, ktorý využíva MERN technologický zásobník."
    },
    {
      "title": "C Sharp",
      "context": "Môj prvý projekt, na ktorom som pracoval, bol mobilná hra s názvom Mark Ball. Táto hra je k dispozícii na stiahnutie na platforme Google Play. Projekt bol implementovaný s využitím programovacieho jazyka C#, avšak v súčasnosti už tento jazyk neovládam."
    }
  ],
  "projects_outro_title":"Súhrn mojich projektov",
  "projects_outro_context":"V týchto projektoch som využil niekoľko technologí. Čo sa týka dizajnových technlógií bol použitý deskriptívny jazyk Html, CSS alebo som sa stretol aj s XML. Taktiež som použil frameworky ako Tailwind alebo Bootstrap a v jednom projekte som aj implementoval Wysivig editor. Čo sa týka knižníc využíval som Flask, Django, React, ExpressJs, Tkinter a iné. Jazyky s ktorými som sa stretol sú C, Python, Javascript, Bash. ",
  "contact_titel": "Kontakt",
  "contact_description": "Ak máte záujem o ďalšie informácie alebo potrebujete pomoc s Vaším projektom, neváhajte ma kontaktovať prostredníctvom e-mailu.",
  "navigation": [
    {
      "title": "Domov"
    },
    {
      "title": "O mne"
    },
    {
      "title": "Moja práca"
    },
    {
      "title": "Prečo ja"
    },
    {
      "title": "Kontakt"
    }
  ],
  "footer": [
    {
      "title": "Domov",
      "redirect": "/"
    },
    {
      "title": "Moje projekty",
      "redirect": "/projects"
    },
    {
      "title": "Certifikáty",
      "redirect": "/certificate"
    }
  ],
  "project_intro": [
    {
      "title": "Moje projekty",
      "context": "Bližšie informácie o mojich projektoch nájdete na mojom profile na platforme GitHub. Tam sú podrobne popísané jednotlivé projekty a poskytnuté návody na ich inštaláciu."
    }
  ]
}