{
  "landingTitle": "Máličko o mne",
  "landingInformation": "Vitajte na mojom portfóliu. Volám sa Richard a som študent Slovenskej Technickej Univerzity FIIT. Už je to vyše 5 rokov čo som sa prvý krát zoznámil s programovaním. Donedávna som väčšinu času trávil ako semi-profesionálny športovec. Svoj voľný čas venujem vzdelávaniu, alebo získavaniu nových skúseností.",
  "workExperienceTitle": "Moje pracovné skúsenosti",
  "workInformation": [
    {
      "title": "Moje preferencie",
      "description": "Najradšej pracujem s OOP programovacími jazykmi a svoj všeobecný prehľad smerujem na web-development. Vo vývoji webu sa hlavne zameriavam na backend. Zvládnem spraviť aj frontend ale nepovažujem sa za dizajnéra, takže proces frontendu mi trvá dlhšie."
    },
    {
      "title": "Pracovné skúsenosti",
      "description": "V priebehu dvoch minulorčných semestrov som pracoval v Slovanete ako stážista. Venovali sme sa internému systému Odoo kde som vyvýjal moduly na mieru. Počas semestra som svoj čas strávil aj s nadstavbovým projektom zameraným na SEO. Vo svojom voľnom čase som pracoval na rôznych vlastných projektoch, alebo som pomáhal známim s ich webstránkami."
    },
    {
      "title": "Znalosti v sucastnosti",
      "description": "V súčasnej dobe ovládam jazyky ako Python, Javascript, C a deskriptývne jazyky html, css, xml. Takisto mám skúsenosť s frameworkami ako je FLask, Django, React, Bootstrap, Tailwind. V projektoch som sa stretol aj s kontajnerizáciou projektov, konkrétne Docker."
    }
  ],
  "interestReasonTitle": "Prečo práve ja",
  "interestInformation": [
    {
      "title": "Hlavný zámer",
      "description": "Mojim hlavným cieľom je zdokonalovať sa vo svojom obore. Svoj osobný rast zlepšujem nielen prácou na zadaní, ale pokúšam sa sledovať a naučiť dobré návyky od skúsenejších Inžinierov."
    },
    {
      "title": "Pracovné prostredie",
      "description": "Od útleho veku som sa venoval spoločenskej športovej disciplíne, takže práca v tíme mi nerobí žiaden problém. Som schopný sa rýchlo prispôsobiť novému pracovnému prostrediu a nehanbím sa pýtať otázky na, ktoré odpoveď nepoznám."
    },
    {
      "title": "Práca pod stresom",
      "description": "Úlohu na, ktorej robím sa vždy snažím odovzdať do deadlinu a dokončiť ju na 100%. Prácovať pod stresom nieje príjemné, ale taktiež to nieje nič čo by som nezvládol. Rozdeľujem si svoje povinnosti tak, aby som nemal problém s ich dokončením."
    }
  ],
  "welcome": "Vitajte na mojom portfóliu!",
  "about": "O mne",
  "cardsOne": [
    {
      "title": "Kúsok o mne",
      "description": "Ahojte, volám sa Richard. Som 21-ročný študent Slovenskej technickej univerzity. Rád sa učim novým schopnostiam a naberám nové znalosti. Som schopný prispôsobiť sa pracovním prostrediam z rôznych oborov. Brigádoval som na stavbe, ako čašník alebo pracoval som ako programátor v Slovanete."
    },
    {
      "title": "Od športu k informatike",
      "description": "Môj záujem o informatiku sa začal, keď som mal 17 rokov. Narazil som na 3D modelovací softvér Blender, počas sledovania videii o hrách. Kód v Blenderi som nepísal, ale začal ma zaujímať proces tvorby hier. Začal som sa učiť programovací jazyk C# a objavil som softvér Unity. To ma priviedlo k vytvoreniu hry s názvom „Mark Ball“, ktorá je dostupná na stiahnutie v obchode Google Play."
    },
    {
      "title": "Prečo som si vybral štúdium informatiky",
      "description": "Vybral som si štúdium informatiky a technológií, pretože mám k tomuto oboru vášeň. Zaujíma ma proces tvorby softvéru, webov a ďalších počítačových prostriedkov. Čo ma na tomto obore baví je, že sa stačí naučiť logické vzory a postupy, ktoré následne môžem používať na tvorbu komplexných projektov."
    }
  ],
  "cardsTwo": [
    {
      "title": "Vzdelanie",
      "description": "Ako malý som navštevoval základnú školu Tilgnerovú. Neskôr som prestúpil na Zš Svätej Uršule. Po základnej škole som sa rozhodol svoje vzdelanie smerovať na šport. Na Strednej Športovej škole v Ružinove som zmaturoval z povinných predmetov, angličtiny, trénerstva, matematiky. Maturoval som aj z informatiky ako dodatočný dobrovoľný predmet. Následne som nastúpil na STU FIIT, na ktorú som chcel nastúpiť už od tretieho ročníka strednej školy."
    },
    {
      "title": "Rané skúsenosti",
      "description": "Na strednej škole som sa začal zaujímať trocha viac o informatiku. V tom čase som študoval programovací jazyk Python a pracoval na niekoľkých projektoch. Používal som Flask a učil sa základným webovým technológiám ako HTML a CSS a experimentoval s rôznymi frameworkami."
    },
    {
      "title": "Moje najnovšie skúsenosti",
      "description": "Počas prvého roku na univerzite som získal veľa nových poznatkov z praxe a aj teoretických informácií. Učili sme sa napríklad, ako sa tvoria väčšie projekty, hlbšie sme sa venovali OOP a abstraktnejším častiam väčších projektov. To, čo som sa naučil na škole, som mohol vidieť v spoločnosti, kde som pracoval. Prax som si získal v oblasti pythonu, kde som sa prvýkrát stretol s xml. Počas školy sme pracovali na viacerých projektoch, kde sme používali C, JavaScript, Shell Scripting a spolupracoval som s jedným prednášajúcim na doplnkovom projekte zameranom na SEO."
    }
  ],
  "projects": [
    {
      "title": "Vysoká škola",
      "sub_projects":[
        {
         "title":"Procedurálne programovanie C",
         "context": "Ako už vieme jazyk C je základom veľa iných programovacích jazykov. Po prvý krát som sa stretol s týmto jazykom na vysokej škole, a venujem sa mu už vyše dvoch rokov. Pravidelne tomuto jazyku boli venované cvičenia či projekty.",
         "tech":[],
         "note" : "Nadobudol som: Základy programovania, Alokácia, Linked listy, Bitové operácie"
        } 
      ]
    },
    {
      "title": "Python",
      "sub_projects":[
        {
          "title":"Odoo ERP",
          "context":"Na mojej prvej oficiálnej pracovnej pozící som pracoval s Enterprise systémom Odoo, kde sme vytvárali moduli na mieru. Pracoval na vývoji modulu, ktorý sledoval zmeny u zamestnancov ako napríklad odchod na materskú, zmena pracovnej pozície a podobne.",
          "tech":["Python", "Docker", "PostreSQL", "Gitlab"],
          "note" : "Myslím si že ma to osobne posunulu, stretol som sa tu s technológiami ako Docker, zlepšil som svoje skúsenosti s pythonom, pracoval som s databázou, pozoroval som ako fungujú IT tímy v praxi."
        },
        {
          "title":"Flask aplikácia",
          "context":"Webová stránka predstavuju blog. Táto aplikácia spĺňala 4 základné operácie CRUD. Na stránke som vytváral aj základné šifrovania údajov ako sha-256.",
          "tech":["Python", "Flask", "Tailwind" , "Bootstrap", "Css", "Wysiwyg editor"],
          "note":""

        },        
        {
          "title":"Django aplikácia",
          "context":"Táto aplikácia slúži ako jednoduchý a flexibilný systém pre objednávky zadané priamo používateľom. Momentálne na tejto aplikácií pracujem.",
          "tech":["Django", "Bootstrap", "Sqlite DB"],
          "note":""
        }
      ]
    },
    {
      "title": "Javascript",
      "sub_projects":[
        {
          "title":"Webová hra",
          "context":"Počas druhého semestra sme pracovali na webovej hre za pomoci javvascriptu. Projekt je organizovaný pomocou formule MVC, obsahuje contstructy, dedenie a ďalšie kritéria. UI je vytvorený pomocou canvasu. Podrobnejší popis kritérií a dokumentáciu ku projektu sa dočítate na mojom githube.",
         "tech":["Javascipr", "Css", "Canvas"],
         "note":"Pri tomto projekte som sa naučil nový OOP jazyk a jeho hlavné charakteristiky."
        },
        {
          "title":"React portfólio",
          "context":"Portfólio na ktorom sa momentálne nachádzate je vytvorené za pomoci reactu. Tento projekt je kontajnerizovaný a obsahuje aj inštrukcie ako spustit projekt lokálne pomocou programu Docker.",
         "tech":["React", "NodeJS", "Tailwind", "Docker", "Nginx", "Bash"],
         "note":""
        },
        {
          "title":"MERN Aplikácia",
          "context":"Tento projekt som si rozpracoval v priebehu letu, no nemal som dostatok času. K tomuto projekt sa plánujem vrátiť v najbližšej dobe.",
         "tech":["Javascript","Mongo DB", "Express", "React", "NodeJS"],
         "note":""
        }
      ]
    },
    {
      "title": "C#",
      "sub_projects":[
       {
        "title":"Mobilná hra",
        "context": "Hru by som zaradil do kategórie Indie, kde hráč musí prejsť niekoľko levelov bez kolízie do iných objektov. Hru som následne pridal na google store kde je stále dostupná na stiahnutie. Jazyk C# momentálne neovládam a ani sa mu aktívne nevenujem.",
        "tech":["C#","Blender", "Unity", "Obchod Play"],
        "note":""
      } 
      ]
    }
  ],
  "future_introduction_title": "Moje plány do budúcnosti",
  "future_introduction": "Môžete si prečítať o projektoch na ktorých momentálne pracujem alebo čo plánujem podniknúť vo svojej budúcnosti. Článok prepnete kliknutím na odkaz alebo napísaním vhodného commandu. Príkazový riadok aktivujete kliknutím na kurzor.",
  "future_command_help": "Displays system chosen article of projects that are being worked on or that are planned to be done in the future",
  "future_error_msg": "Your input is spelled wrongly! Only possible option is article -[type]",
  "future": [
    {
      "command": "mern -r",
      "title": "Mern aplikácia ",
      "command_des": "Načítate si text opisujúci aplikáciu založenú na MERN tech stacku.",
      "description": "Tento projekt by mal byť dokončený v priebehu jedného až dvoch rokov. Vo finálnom výsledku by to mala byť aplikácia pre gastro podniky ktorá zjednoduchší organizáciu tímu v gastre. Taktiež bude použiteľná pre ľudí, ktorý si budú schopný objednať jedlo alebo rezervovať stôl. Aplikácia je založená hlavne na MERN tech stacku čo znamená Mongo databáza, Express js pre backend, React pre frontend a celá aplikácia beží za pomoci node js. Využívam pri tvorbe rôzne externé softwary ale spomínané technológie sú základ."
    },
    {
      "command": "blog -i",
      "title": "Blog",
      "command_des": "Zobrazí sa článok o naplánovanom projekte blogu.",
      "description": "Hlavný zámer blogu je rozšírť si znalosť v jazykoch, získať skúsenosť vo vedení tímu a opakovanie si tém preberaných v škole. V blogu by som chcel využiť materiály poskytované Fakultou a preskúmať preberané témy hlbšie o ktorých by som následne písal články. Články budú napísané aj v cudzích jazykoch čím by som si vylepšil slovník a upevnil základy cudzích jazykov."
    },
    {
      "command": "education -n",
      "title": "Vzdelávanie do budúcna",
      "command_des": "Článok vysvetlí na čo sa chcem do budúcna zamerať",
      "description": "Do budúcna sa plánujem naučiť plinulo rozprávať minimálne ďaľším jedným cudzím jazykom. Svoje vzdelanie by som chcel smerovať hlavne na inovatívnu časť informatiky ako AI, ML a podobné. Mojim cieľom je pomôcť ľudom zjednoduchšiť ich prácu."
    }
  ],
  "contact_titel": "Kontaktujete ma!",
  "contact_description": "Ak Vás moje portfólio zaujalo neváhajte ma kontaktovať prostredníctvom mailu. Rád Vám odpoviem na Vaše otázky alebo pomôžem s vašim projektom.",
  "navigation": [
    {
      "title": "Domov"
    },
    {
      "title": "O mne"
    },
    {
      "title": "Moja práca"
    },
    {
      "title": "Prečo ja"
    },
    {
      "title": "Kontakt"
    }
  ],
  "footer": [
    {
      "title": "Domov",
      "redirect": "/"
    },
    {
      "title": "Moje projekty",
      "redirect": "/projects"
    },
    {
      "title": "Certifikáty",
      "redirect": "/certificate"
    }
  ],
  "freelanc_intro": "Ponuka Freelancingu",
  "freelance_intro_title": "Prečo sa chcem venovať freelancingu",
  "freelance_reasons": [
    {
      "title": "Nabrať nové skúsenosti a prax",
      "context": "Hlavným zámerom je osobný rast. Freelancingu sa chcem venovať, aby som si rozšíril svoje vedomosti a upevnil prax. Rád sa pripojím na rozbehnutý projekt a pomôžem s vývojom alebo vytvorím nový projekt od základov podľa predstáv zákaznika."
    },
    {
      "title": "Komunikácia a organizácia",
      "context": "Keďže programovanie a práca na väčších projektoch nieje len o znalosti programovania ale aj organizácií a komunikácií v tíme, alebo komunikácií medzi sprostredkúvateľom a zákaznikom, rád by som sa v týchto kvalitách zlepšil. "
    }
  ],
  "freelance_content": [
    {
      "title": "Pracovné skúsensoti",
      "context": "Svoje programovacie skúsenosti som začal s jazykom C#, kde som vyvynul mobilnú hru za pomoci programu Unity. Následne sem sa venoval primárne Pythonu a deskriptívnym jazykom ako CSS, Html. Pri svojich projektoch zvyknem používať pre dizajn hlavne frameworky ako Bootstrap alebo Tailwind. Na vysokej škole som sa naučil programovací jazyk nižšej úrovni C. V priebehu semestra sme prebrali aj Javascript, s ktorým som následne rozšíril svoje znalosti v Reacte. Počas semestra som pracoval v ERP systéme Odoo kde som vyvýjal moduly pre firmu Slovanet. Svoje programovacie znalosti sa snažím smerovť hlavne na backendové časti programov."
    },
    {
      "title": "Ako viem pomôcť Vášmu projektu",
      "context": "Na základe Vašich požíadaviek viem posúdiť ako náročné je pre mňa takýto projekt vypracovať. Som schopný pracovať hlavne na developmenete webových stránkach, venujem sa primárne Backendovým častiam ale zvládnem aj Dizajnovú časť stránky. Mojim cieľom je uspokojiť na 100% zákaznikové požiadavky, alebo požiadavky môjho nadriadeného. Dokážem pracovať pod stresom alebo pod časovým limitom. Zákaznika alebo zamestnávateľa pravideľne infromujem o priebehu môjho progresu."
    }
  ],
  "freelance_contact": "Neváhajte ma kontaktovať",
  "freelance_contact_content": "Ak som Vás zaujal a chceli by ste aby som bol súčasťou Vášho projektu neváhajte ma kontaktovať. Zodpoviem všetky vaše dotazy a otázky prípadne sa môžeme spojiť pomocou online hovoru.",

  "project_intro": [
    {
      "title": "Moje projekty",
      "context": "Môžete sa dočítať podrobnejšie informácie o mojich projektoch a skúsenostiach."
    }
  ]
}